nikhil-robinson/micropython-idf/components/board/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME               "PLAYCOMPUTER-V1.0"
#define MICROPY_HW_MCU_NAME                 "ESP32-S3"
#define MICROPY_PY_NETWORK_HOSTNAME_DEFAULT "PLAYCOMPUTER"

#define MICROPY_PY_MACHINE_DAC              (0)
#define MICROPY_PY_BLUETOOTH                (0)


#define MICROPY_HW_I2C0_SCL                 (9)
#define MICROPY_HW_I2C0_SDA                 (8)

#define MICROPY_HW_I2C1_SCL                 (15)
#define MICROPY_HW_I2C1_SDA                 (16)


#define MICROPY_REPL_EVENT_DRIVEN           (0)